<?php
require_once 'require.php';
$Fines = new Fines();
$fine_categories = $Fines->getFineCategories();
$Users = new Users();
$users = $Users->getAllUsers();
$employees = $Users->getEmployees();
?>
<!DOCTYPE html>
<html lang="ru">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Nanike</title>
    <script src="../js/jquery-3.4.1.js"></script>
    <script src="../js/jquery.maskedinput.min.js"></script>
    <link rel="stylesheet" href="../css/styleAdd.css ">
    <link rel="stylesheet" href="../css/style.css">
</head>

<body>
    

    <?php require_once "header.php"; ?>

    <?php if($_SESSION['user_id'] == 16): ?>
<main>
        <section class="mainCab">
            <form action="handler.php" method="post" enctype="multipart/form-data">
                <h1>добавить новость</h1>
                <section class="akk">
                    <h2>Админ</h2>
                </section>
                <section class="chages">
                    <div>
                        <article>
                            <h3>название новости</h3>
                        </article>
                        <input required class="numTC" type="text" name="title">
                    </div>
                    <div>
                        <article>
                            <h3>описание новости</h3>
                        </article>
                        <input required class="numTC1" type="text" name="description">
                    </div>
                    <div>
                        <article>
                            <h3>источник</h3>
                        </article>
                        <input required class="numTC2" placeholder="@mail" type="text" name="link">
                    </div>
                </section>
                <section class="chages">
                    <div>
                        <article>
                            <h3>Добавить картинку</h3>
                        </article>
                        <input required class="numTC10" placeholder="новый пароль" type="file" name="img">
                    </div>
                </section>
                <article class="save">
                    <input type="submit" id="news-submit" name="news_submit">
                </article>
            </form>
            <h1>
                добавить штраф
            </h1>
            <form action="handler.php" method="post" enctype="multipart/form-data">
                <section class="chages" style="flex-wrap: wrap">
                    <div>
                        <article>
                            <h3>сертификат ТС</h3>
                        </article>
                        <input required class="numTC3" placeholder="******" type="text" name="sts">
                    </div>
                    <div>
                        <article>
                            <h3>описание штрафа</h3>
                        </article>
                        <input required class="numTC4" placeholder="******" type="text" name="description">
                    </div>
                    <div>
                        <article>
                            <h3>дата совершения</h3>
                        </article>
                        <input required class="numTC5" type="text" name="date">
                    </div>
                    <div>
                        <article>
                            <h3>выберите категорию</h3>
                        </article>
                        <select name="fine_category" id="fine_categorie" name="category">
                            <?php foreach ($fine_categories as $item): ?>
                                <option value="<?php echo $item['ID_fine_category'] ?>"><?php echo $item['fine_category_name'] ?></option>
                            <?php endforeach;?>
                        </select>
                    </div>
                    <div>
                        <article>
                            <h3>выберите ID пользователя</h3>
                        </article>
                        <select id="user_id" name="user_id">
                            <?php foreach ($users as $item): ?>
                                <option value="<?php echo $item['ID_client'] ?>"><?php echo $item['ID_client'] ?></option>
                            <?php endforeach;?>
                        </select>
                    </div>
                    <div>
                        <article>
                            <h3>выберите сотрудника</h3>
                        </article>
                        <select id="user_id" name="employee">
                            <?php foreach ($employees as $item): ?>
                                <option value="<?php echo $item['ID_employees'] ?>"><?php echo $item['Surname_Employees'] . " " .  $item['Name_Employees']  . " " . $item['Patronymic_Employees'] ?></option>
                            <?php endforeach;?>
                        </select>
                    </div>
                    <div>
                        <article>
                            <h3>стоимость штрафа</h3>
                        </article>
                        <input required class="numTC4" type="text" name="fine_value">
                    </div>
                </section>
                <section class="chages">
                    <div>
                        <article>
                            <h3>Добавить картинку</h3>
                        </article>
                        <input required class="numTC6" placeholder="новый пароль" type="file" name="img">
                    </div>
                </section>
                <article class="save">
                    <input type="submit" id="news-submit" name="fine_submit">
                </article>
            </form>


        </section>
    </main>
    <?php else: ?>
        <img src="../img/nigger.jpg" alt="" style="width: 50vw; margin: 200px auto; display: block">
    <?php endif; ?>
    

    <footer>
        <section>
            <div>
                <img src="../img/1-removebg-preview.png" alt="">
                <p>
                    Официальный сайт Министерства внутренних дел Российской Федерации
                    © 2022, ГИБДД МВД России
                </p>
            </div>
            <div class="footerRight">
                <h2>
                    327 967 уникальных посетителей сегодня
                </h2>
                <article>
                    <a href="">
                        <svg xmlns="http://www.w3.org/2000/svg" width="36" height="30" viewBox="0 0 36 30" fill="none">
                            <path
                                d="M36 14.8775C36 14.7793 36 14.6677 35.996 14.5382C35.992 14.1766 35.9839 13.7704 35.9759 13.3373C35.9438 12.0918 35.8875 10.8507 35.7991 9.68108C35.6786 8.06948 35.5018 6.72573 35.2607 5.7168C35.0063 4.66389 34.5077 3.70362 33.8146 2.93196C33.1215 2.1603 32.2583 1.60428 31.3112 1.31948C30.1741 0.98019 27.9482 0.770368 24.8143 0.640904C23.3237 0.578404 21.7286 0.538225 20.1335 0.515904C19.575 0.506975 19.0567 0.502511 18.5906 0.498047H17.4094C16.9433 0.502511 16.425 0.506975 15.8665 0.515904C14.2714 0.538225 12.6763 0.578404 11.1857 0.640904C8.05179 0.774832 5.82187 0.984654 4.68884 1.31948C3.74143 1.60358 2.87787 2.15937 2.18469 2.93113C1.4915 3.7029 0.993054 4.66355 0.739286 5.7168C0.494196 6.72573 0.321429 8.06948 0.200893 9.68108C0.1125 10.8507 0.0562499 12.0918 0.0241071 13.3373C0.0120535 13.7704 0.00803565 14.1766 0.0040178 14.5382C0.0040178 14.6677 0 14.7793 0 14.8775V15.1275C0 15.2257 -6.13675e-08 15.3373 0.0040178 15.4668C0.00803565 15.8284 0.0160714 16.2347 0.0241071 16.6677C0.0562499 17.9132 0.1125 19.1543 0.200893 20.3239C0.321429 21.9355 0.498214 23.2793 0.739286 24.2882C1.25357 26.4266 2.76429 28.1141 4.68884 28.6856C5.82187 29.0248 8.05179 29.2347 11.1857 29.3641C12.6763 29.4266 14.2714 29.4668 15.8665 29.4891C16.425 29.4981 16.9433 29.5025 17.4094 29.507H18.5906C19.0567 29.5025 19.575 29.4981 20.1335 29.4891C21.7286 29.4668 23.3237 29.4266 24.8143 29.3641C27.9482 29.2302 30.1781 29.0204 31.3112 28.6856C33.2357 28.1141 34.7464 26.4311 35.2607 24.2882C35.5058 23.2793 35.6786 21.9355 35.7991 20.3239C35.8875 19.1543 35.9438 17.9132 35.9759 16.6677C35.9879 16.2347 35.992 15.8284 35.996 15.4668C35.996 15.3373 36 15.2257 36 15.1275V14.8775ZM33.1071 15.1097C33.1071 15.2034 33.1071 15.3061 33.1031 15.4266C33.0991 15.7748 33.0911 16.1588 33.083 16.5739C33.0549 17.7614 32.9987 18.9489 32.9143 20.0516C32.8058 21.4891 32.6531 22.6677 32.4643 23.4579C32.2152 24.4891 31.4839 25.3061 30.5598 25.5784C29.7161 25.8284 27.5906 26.0293 24.7018 26.1498C23.2393 26.2123 21.6643 26.2525 20.0933 26.2748C19.5429 26.2838 19.0326 26.2882 18.5746 26.2882H17.4254L15.9067 26.2748C14.3357 26.2525 12.7647 26.2123 11.2982 26.1498C8.40938 26.0248 6.27991 25.8284 5.44018 25.5784C4.51607 25.3016 3.78482 24.4891 3.53571 23.4579C3.34687 22.6677 3.1942 21.4891 3.08571 20.0516C3.00134 18.9489 2.94911 17.7614 2.91696 16.5739C2.90491 16.1588 2.90089 15.7704 2.89688 15.4266C2.89688 15.3061 2.89286 15.1989 2.89286 15.1097V14.8954C2.89286 14.8016 2.89286 14.6989 2.89688 14.5784C2.90089 14.2302 2.90893 13.8463 2.91696 13.4311C2.94509 12.2436 3.00134 11.0561 3.08571 9.9534C3.1942 8.5159 3.34687 7.33733 3.53571 6.54715C3.78482 5.5159 4.51607 4.69894 5.44018 4.42662C6.28393 4.17662 8.40938 3.97572 11.2982 3.85519C12.7607 3.79269 14.3357 3.75251 15.9067 3.73019C16.4571 3.72126 16.9674 3.7168 17.4254 3.7168H18.5746L20.0933 3.73019C21.6643 3.75251 23.2353 3.79269 24.7018 3.85519C27.5906 3.98019 29.7201 4.17662 30.5598 4.42662C31.4839 4.7034 32.2152 5.5159 32.4643 6.54715C32.6531 7.33733 32.8058 8.5159 32.9143 9.9534C32.9987 11.0561 33.0509 12.2436 33.083 13.4311C33.0951 13.8463 33.0991 14.2347 33.1031 14.5784C33.1031 14.6989 33.1071 14.8061 33.1071 14.8954V15.1097ZM14.4241 20.9847L23.7455 14.9579L14.4241 9.02037V20.9847Z"
                                fill="#F2F2F2" />
                        </svg>
                    </a>
                    <a href="">
                        <svg xmlns="http://www.w3.org/2000/svg" width="29" height="29" viewBox="0 0 29 29" fill="none">
                            <path
                                d="M27.84 0H1.16C0.518375 0 0 0.518375 0 1.16V27.84C0 28.4816 0.518375 29 1.16 29H27.84C28.4816 29 29 28.4816 29 27.84V1.16C29 0.518375 28.4816 0 27.84 0ZM26.68 26.68H20.0064V17.7698H23.7764L24.3419 13.3944H20.0064V10.5995C20.0064 9.33075 20.358 8.468 22.1741 8.468H24.4905V4.553C24.0881 4.49863 22.7143 4.379 21.112 4.379C17.7698 4.379 15.4824 6.41987 15.4824 10.1645V13.3907H11.7051V17.7661H15.486V26.68H2.32V2.32H26.68V26.68Z"
                                fill="white" />
                        </svg>
                    </a>
                    <a href="">
                        <svg xmlns="http://www.w3.org/2000/svg" width="28" height="29" viewBox="0 0 28 29" fill="none">
                            <path
                                d="M13.9962 7.0601C10.0211 7.0601 6.81302 10.3828 6.81302 14.5C6.81302 18.6172 10.0211 21.9399 13.9962 21.9399C17.9713 21.9399 21.1795 18.6172 21.1795 14.5C21.1795 10.3828 17.9713 7.0601 13.9962 7.0601ZM13.9962 19.3354C11.4255 19.3354 9.32767 17.1625 9.32767 14.5C9.32767 11.8375 11.4255 9.66461 13.9962 9.66461C16.5669 9.66461 18.6648 11.8375 18.6648 14.5C18.6648 17.1625 16.5669 19.3354 13.9962 19.3354ZM21.4736 5.02147C20.5455 5.02147 19.796 5.79775 19.796 6.75902C19.796 7.72029 20.5455 8.49657 21.4736 8.49657C22.4018 8.49657 23.1513 7.72392 23.1513 6.75902C23.1515 6.53076 23.1083 6.30469 23.0241 6.09375C22.9399 5.88281 22.8163 5.69115 22.6605 5.52975C22.5047 5.36834 22.3196 5.24037 22.116 5.15315C21.9123 5.06593 21.694 5.02118 21.4736 5.02147ZM27.9984 14.5C27.9984 12.4976 28.0159 10.5134 27.9074 8.51471C27.7988 6.19314 27.2875 4.13275 25.6484 2.4351C24.0058 0.733824 22.02 0.207844 19.7785 0.0953926C17.8453 -0.0170583 15.9295 0.00107896 13.9997 0.00107896C12.0665 0.00107896 10.1507 -0.0170583 8.22094 0.0953926C5.97947 0.207844 3.99016 0.737451 2.35109 2.4351C0.708507 4.13637 0.200673 6.19314 0.0921015 8.51471C-0.0164698 10.5171 0.00104174 12.5013 0.00104174 14.5C0.00104174 16.4987 -0.0164698 18.4866 0.0921015 20.4853C0.200673 22.8069 0.712009 24.8673 2.35109 26.5649C3.99367 28.2662 5.97947 28.7922 8.22094 28.9046C10.1542 29.0171 12.07 28.9989 13.9997 28.9989C15.933 28.9989 17.8488 29.0171 19.7785 28.9046C22.02 28.7922 24.0093 28.2625 25.6484 26.5649C27.291 24.8636 27.7988 22.8069 27.9074 20.4853C28.0195 18.4866 27.9984 16.5024 27.9984 14.5ZM24.9164 23.0535C24.6607 23.7137 24.3525 24.2071 23.8587 24.7149C23.3649 25.2264 22.8921 25.5456 22.2547 25.8104C20.4125 26.5685 16.0381 26.398 13.9962 26.398C11.9544 26.398 7.57652 26.5685 5.73431 25.814C5.09689 25.5492 4.62058 25.23 4.13025 24.7185C3.63643 24.2071 3.32823 23.7174 3.07256 23.0572C2.34408 21.1455 2.50869 16.6148 2.50869 14.5C2.50869 12.3852 2.34408 7.85088 3.07256 5.94284C3.32823 5.28265 3.63643 4.78931 4.13025 4.28147C4.62408 3.77363 5.09689 3.45078 5.73431 3.18598C7.57652 2.43147 11.9544 2.60196 13.9962 2.60196C16.0381 2.60196 20.416 2.43147 22.2582 3.18598C22.8956 3.45078 23.3719 3.77 23.8622 4.28147C24.356 4.79294 24.6642 5.28265 24.9199 5.94284C25.6484 7.85088 25.4838 12.3852 25.4838 14.5C25.4838 16.6148 25.6484 21.1455 24.9164 23.0535Z"
                                fill="white" />
                        </svg>
                    </a>
                </article>
                <a href="">
                    Об использовании информации сайта
                </a>
            </div>
        </section>
    </footer>

    <div style="display: none;" class=" back"></div>
    <div style="display: none;" class=" napishiMneSMS">
        <h2>обратная связь</h2>
        <section>
            <input class="numTC7" placeholder="логин" type="text">
            <input class="numTC8" placeholder="e-mail" type="text">
            <select>
                <option label="выбрать тему" value="1" selected>выбрать тему</option>
                <option>неправильное отображение на сайте</option>
                <option>неверная информация</option>
                <option>другое</option>
            </select>
            <textarea placeholder="напишите о вашей проблеме" class="numTC9"></textarea>
        </section>
        <article class="sendSMS">
            <div>
                отправить
            </div>
        </article>
    </div>
    <?php require_once 'log_in.php'; ?>
    <div style="display: none;" class="congrat">спасибо за ваш отзыв</div>
    <script src="../js/scriptsAdd.js"></script>

</body>

</html>